# Preppin' Data 2022 Week 3

#### Load data

In [141]:
import pandas as pd

In [142]:
pupils = pd.read_csv('PD 2022 Wk 1 Input - Input.csv')

In [143]:
grades = pd.read_csv('PD 2022 WK 3 Grades.csv')

#### Join data together

In [144]:
df = pupils.merge(grades, how='left', left_on='id', right_on='Student ID')

In [145]:
df.head()

,id,pupil first name,pupil last name,gender,Date of Birth,Parental Contact Name_1,Parental Contact Name_2,Preferred Contact Employer,Parental Contact,Student ID,Maths,English,Spanish,Science,Art,History,Geography
0,1,Ronna,Nellies,Female,12/21/2013,Purcell,Ketti,Demizz,1,1,66,97,85,75,76,94,76
1,2,Rusty,Andriulis,Male,7/21/2012,Vassili,Rivi,Brainbox,1,2,84,85,62,87,68,75,74
2,3,Roberta,Oakeshott,Female,12/4/2011,Lind,Haskell,Centidel,2,3,88,68,69,81,92,89,75
3,4,Lola,Rubinfajn,Male,6/29/2012,Elie,Tresa,Edgeblab,2,4,65,97,96,89,98,77,62
4,5,Kamila,Benedtti,Female,7/10/2012,Adela,Clevey,Trudoo,1,5,86,97,94,98,67,77,97

#### Remove unwanted fields

In [146]:
df = df.drop(['id','pupil first name','pupil last name','Date of Birth',\
              'Parental Contact Name_1','Parental Contact Name_2','Preferred Contact Employer',\
              'Parental Contact'], axis=1)

#### Pivot the data to create one row of data per student and subject

In [147]:
df = pd.melt(df, id_vars=['Student ID','gender'])

In [148]:
df = df.rename(columns={'variable':'Subject', 'value':'Score', 'gender':'Gender'})

In [149]:
df.head()

   Student ID  Gender Subject  Score
0           1  Female   Maths     66
1           2    Male   Maths     84
2           3  Female   Maths     88
3           4    Male   Maths     65
4           5  Female   Maths     86

#### Create an average score per student based on all of their grades

In [150]:
df["Student's Avg Score"] = round(df.groupby(['Student ID'])['Score'].transform('mean'), 1)

In [151]:
df.head()

   Student ID  Gender Subject  Score  Student's Avg Score
0           1  Female   Maths     66                 81.3
1           2    Male   Maths     84                 76.4
2           3  Female   Maths     88                 80.3
3           4    Male   Maths     65                 83.4
4           5  Female   Maths     86                 88.0

In [152]:
# test output
df.loc[df['Student ID']==985]

      Student ID Gender    Subject  Score  Student's Avg Score
984          985   Male      Maths     61                 85.6
1984         985   Male    English     96                 85.6
2984         985   Male    Spanish     94                 85.6
3984         985   Male    Science     94                 85.6
4984         985   Male        Art     83                 85.6
5984         985   Male    History     96                 85.6
6984         985   Male  Geography     75                 85.6

#### Check pass rate

In [153]:
df['Pass or Fail'] = df['Score'].apply(lambda x: 'Pass' if x >= 75 else 'Fail')

In [154]:
df.head()

   Student ID  Gender Subject  Score  Student's Avg Score Pass or Fail
0           1  Female   Maths     66                 81.3         Fail
1           2    Male   Maths     84                 76.4         Pass
2           3  Female   Maths     88                 80.3         Pass
3           4    Male   Maths     65                 83.4         Fail
4           5  Female   Maths     86                 88.0         Pass

#### Aggregate the data per student to count how many subjects each student passed

In [133]:
#df = df.drop(df[df['Pass or Fail'] == 'Fail'].index)

In [161]:
df['Pass Counts'] = df['Pass or Fail'].apply(lambda x: 1 if x=='Pass' else 0)

In [166]:
df['Passed Subjects'] = df.groupby(['Student ID'])['Pass Counts'].transform('sum')

In [167]:
df.head()

,Student ID,Gender,Subject,Score,Student's Avg Score,Pass or Fail,Passed Subjects,Pass Counts
0,1,Female,Maths,66,81.3,Fail,6,0
1,2,Male,Maths,84,76.4,Pass,4,1
2,3,Female,Maths,88,80.3,Pass,5,1
3,4,Male,Maths,65,83.4,Fail,5,0
4,5,Female,Maths,86,88.0,Pass,6,1

#### Remove any unnecessary fields and output the data

In [172]:
df = df.drop(['Subject','Score','Pass or Fail','Pass Counts'], axis=1)

In [173]:
df=df.drop_duplicates()

In [174]:
df

     Student ID  Gender  Student's Avg Score  Passed Subjects
0             1  Female                 81.3                6
1             2    Male                 76.4                4
2             3  Female                 80.3                5
3             4    Male                 83.4                5
4             5  Female                 88.0                6
..          ...     ...                  ...              ...
995         996  Female                 87.0                6
996         997  Female                 90.0                7
997         998    Male                 81.1                5
998         999  Female                 74.0                3
999        1000  Female                 79.4                5

[1000 rows x 4 columns]

In [177]:
df.to_csv('2022W03_output.csv', index=False)